Repository: Daniel-KM/Omeka-S-module-Menu
Catalog: language/*.po
Languages: fr

source: %d menus successfully deleted
fr: %d menus ont été supprimés avec succès

source: [no label]
fr: [pas de libellé]

source: This block uses the options set in the %ssite settings%s, unless you use the template of Omeka in the config of the block.
fr: Le bloc utilise les options indiquées dans les %sparamètres du site%s, à moins d’utiliser le modèle de bloc d’omeka.

source: Current page
fr: Page actuelle

source: [Unknown resource]
fr: [Ressource inconnue]

source: [Unknown resource #%d]
fr: [Ressource inconnue #%d]

source: Breadcrumb
fr: Fil d’Ariane

source: Resource id
fr: Id de la ressource

source: Resource unavailable
fr: Ressource indisponible

source: Optional label
fr: Libellé facultatif

source: Optional html class
fr: Classe html facultative

source: New menu
fr: Nouveau menu

source: Add new menu
fr: Ajouter un nouveau menu

source: Select menu
fr: Menu de sélection

source: Delete menus
fr: Supprimer les menus

source: Are you sure you would like to delete the selected menus?
fr: Êtes-vous sûr de vouloir supprimer les menus sélectionnés ?

source: %1$s: this action will permanently delete %2$s menus and cannot be undone.
fr: %1$s : cette action supprimera le menu %2$s définitivement et ne pourra pas être annulée.

source: Omeka could not find any menus.
fr: Omeka ne trouve aucun menu.

source: Delete menu "%s"
fr: Supprimer le menu « %s »

source: Tops to menus
fr: Éclater en menus

source: Create a new menu for each top menu
fr: Créer un nouveau menu pour chaque menu de premier niveau

source: Open all
fr: Tout ouvrir

source: Close all
fr: Tout fermer

source: The settings for "Breadcrumbs" were upgraded.
fr: Les paramètres pour le fil d’Ariane ont été mis à jour.

source: The helper "PrimaryItemSet" was moved from module %1$sNext%2$s and a param is added for it in %3$smain settings%2$s.
fr: Le view/helper « PrimaryItemSet » a été ajouté depuis le module %1$sNext%2$s et une option a été ajoutée dans les %3$sparamètres généraux%2$s.

source: A %1$ssetting%2$s has been added to update related resources when saving menu.
fr: Un %1$sparamètre%2$s a été ajouté pour mettre à jour les ressources liées lorsque le menu est enregistré.

source: Breadcrumbs were moved from module Block Plus to module Menu. Settings were migrated.
fr: Le fil d’Ariane a été déplacé du module Block Plus au module Menu. Les paramètres ont été migrés.

source: Menu: Fill as broader when saving menu
fr: Menu : Définir comme générique en enregistrant le menu

source: Menu: Fill as narrower when saving menu
fr: Menu : Définir comme spécifique en enregistrant le menu

source: No menu exists with name "{menu_name}" in site #{site_id}.
fr: Aucun menu avec le nom "{menu_name}" dans le site #{site_id}.

source: The settings does not require to update resources.
fr: Les paramètres ne demandent pas de mettre à jour les ressources.

source: No relations to create: settings "broader" and "narrower" are no defined.
fr: Aucune relation créée: les paramètres "générique" et "spécifiques" ne sont pas définis.

source: Settings for "broader" or "narrower" are not correct.
fr: Les paramètres pour "générique" ou "spécifique" ne sont pas corrects.

source: Resource #{resource_id} does not exist.
fr: La ressource #{resource_id} n’existe pas.

source: Resource #{resource_id} has no template and cannot be updated.
fr: La ressource #{resource_id} n’a pas de modèle et ne peut pas être mise à jour.

source: Resource #%1$d has a template not in the limited list of templates.
fr: La ressource #%1$d a un modèle qui n’est pas dans la liste des modèles.

source: The template {template_label} (#{template_id}) has no properties to update.
fr: Le modèle {template_label} (#{template_id}) n’a pas de propriété à mettre à jour.

source: End of the job: {total} menu elements, {count} resources, {count_updated}/{count_processed} resources updated, {count_error} errors.
fr: Fin de la tâche : {total} éléments de menu, {count} ressources, {count_updated}/{count_processed} ressources mises à jour, {count_error} erreurs.

source: Breadcrumbs
fr: Fil d’Ariane

source: Menu for resource pages
fr: Menu pour les pages de ressource

source: Select the menu to display on resource pages (items, media, item sets) via the resource block "Menu".
fr: Choisir le menu à afficher sur les pages de ressource (contenus, médias, collections) via le bloc de ressource "Menu".

source: Select a menu…
fr: Choisir un menu…

source: Crumbs
fr: Fil d’Ariane

source: Prepend home
fr: Ajouter la page d’accueil au début

source: Include "Collections"
fr: Inclure « Collections »

source: Include main item set for item
fr: Inclure la collection principale du contenu

source: Include item sets tree
fr: Inclure l’arborescence des collections

source: Append current resource
fr: Ajouter la ressource en cours

source: Append current resource as a link
fr: Ajouter la ressource en cours en tant que lien

source: Prepended links
fr: Liens à ajouter au début

source: List of urls followed by a label, separated by a "=", one by line, that will be prepended to the breadcrumb.
fr: Liste des urls suivis par un libellé, séparés par un « = », une par ligne, qui seront ajoutées au fil d’Ariane.

source: Url for collections
fr: Url pour les collections

source: The url to use for the link "Collections", if set above. Let empty to use the default one.
fr: L’url à utiliser pour le lien « Collections », si ajouté ci-dessus. Laisser vide pour utiliser l’url par défaut.

source: Separator
fr: Séparateur

source: The separator between crumbs may be set as raw text or via css. it should be set as an html text ("&gt;").
fr: Le séparateur entre les éléments du fil d’Ariane doit être indiqué en tant que texte brut ou via les css. Il doit être indiqué comme chaîne html (« &gt; »).

source: Display on home page
fr: Afficher sur la page d’accueil

source: Update resources on menu saving
fr: Mettre à jour les ressources à l’enregistrement du menu

source: Only when properties below exist in resource template
fr: Seulement lorsque les propriétés ci-dessous existent dans le modèle de ressource

source: According to template property settings (requires module Advanced Resource Template)
fr: Conformément aux paramètres de la propriété du modèle (nécessite le module Advanced Resource Template)

source: Limit update to specific templates
fr: Limiter la mise à jour des à des modèles spécifiques

source: Select templates…
fr: Choisir des modèles…

source: Properties to store a broader linked resource
fr: Propriété pour enregistrer une ressource liée générique

source: Automatically update resources by adding a value to it when the menu uses resources. It may be dcterms:isPartOf or skos:broader or any other property.
fr: Mettre à jour automatiquement les ressources en ajouter une valeur dans un menu utilisant les ressources. La propriété peut être dcterms:isPartOf, skos:broader ou toute autre.

source: Select properties…
fr: Choisir des propriétés…

source: Properties to store a narrower linked resource
fr: Propriétés pour enregistrer une ressource liée spécifique

source: Automatically update resources by adding a value to it when the menu uses resources. It may be dcterms:hasPart or skos:narrower or any other property.
fr: Mettre à jour automatiquement les ressources en ajouter une valeur dans un menu utilisant les ressources. La propriété peut être dcterms:hasPart, skos:narrower ou toute autre.

source: Menu name
fr: Nom du menu

source: Menu "%s" successfully deleted
fr: Le menu « %s » a été supprimé avec succès

source: You must select at least one menu to batch delete.
fr: Vous devez choisir au moins un menu à supprimer.

source: This menu is empty and cannot be divided.
fr: Ce menu est vide et ne peut pas être divisé.

source: Menu "%s" successfully created
fr: Le menu « %s » a été créé avec succès

source: Menus "%s" successfully created
fr: Les menus « %s » ont été créés avec succès

source: Menu "%s" uses an existing name and was renamed "%s".
fr: Le menu « %s » utilise un nom existant et a été renommé « %s ».

source: Menu "%s" was saved successfully.
fr: Le menu « %s » a été enregistré avec succès.

source: The settings require to update the resources when saving menu, but no properties are defined.
fr: Les paramètres demandent de mettre à jour les ressources lors de l’enregistrement du menu, mais aucune propriété n’est définie.

source: Processing update of relations of the resources, if any, in background (job %1$s#%2$d%3$s, %4$slogs%3$s).
fr: Traitement des mises à jour des éventuelles relations des ressources en arrière plan (jtâche %1$s#%2$d%3$s, %4$sjournaux%3$s).

source: Menu "%s" uses a reserved name and was renamed "%s".
fr: Le menu « %s » utilises un nom réservé et a été renommé « %s ».

source: Invalid navigation: resource link missing resource ID
fr: Navigation invalide : le lien de la ressource n’a pas d’ID

source: Select the menu to display.
fr: Choisir le menu à afficher.

source: Menu: Omeka breadcrumbs
fr: Menu : Fil d’Ariane Omeka
